fixtures/vcr_cassettes/books_no_cnx_id.yaml

interactions:
- request:
    body: "<?xml version=\"1.0\" encoding=\"utf-8\" ?>\n<env:Envelope\n        xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n
      \       xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n        xmlns:env=\"http://schemas.xmlsoap.org/soap/envelope/\"\n
      \       xmlns:urn=\"urn:partner.soap.sforce.com\">\n    <env:Header>\n        <urn:CallOptions>\n
      \           <urn:client>simple-salesforce</urn:client>\n            <urn:defaultNamespace>sf</urn:defaultNamespace>\n
      \       </urn:CallOptions>\n    </env:Header>\n    <env:Body>\n        <n1:login
      xmlns:n1=\"urn:partner.soap.sforce.com\">\n            <n1:username></n1:username>\n
      \           <n1:password></n1:password>\n
      \       </n1:login>\n    </env:Body>\n</env:Envelope>"
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '744'
      SOAPAction:
      - login
      User-Agent:
      - python-requests/2.31.0
      charset:
      - UTF-8
      content-type:
      - text/xml
    method: POST
    uri: https://test.salesforce.com/services/Soap/u/57.0
  response:
    body:
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns="urn:partner.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><loginResponse></loginResponse></soapenv:Body></soapenv:Envelope>
    headers:
      Cache-Control:
      - no-cache,must-revalidate,max-age=0,no-store,private
      Content-Encoding:
      - gzip
      Content-Length:
      - '831'
      Content-Type:
      - text/xml; charset=utf-8
      Date:
      - Tue, 27 Feb 2024 23:19:20 GMT
      Set-Cookie:
      - BrowserId=opdPKNXGEe6eta19-CJo0A; domain=.salesforce.com; path=/; expires=Wed,
        26-Feb-2025 23:19:20 GMT; Max-Age=31536000
      Vary:
      - Accept-Encoding
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer 00DOx000002qc01!AQEAQF2cYbO.p0JWJlBNDnChZd7X5xizdDbtmoe.29hI9rztJW0J8hN8VuzWnVfb55rN0PWexxpTHIeHrW7U5sFx4.trlQ85
      Connection:
      - keep-alive
      Content-Type:
      - application/json
      Cookie:
      - BrowserId=opdPKNXGEe6eta19-CJo0A
      User-Agent:
      - python-requests/2.31.0
      X-PrettyPrint:
      - '1'
    method: GET
    uri: https://openstax--staging.sandbox.my.salesforce.com/services/data/v57.0/query/?q=Select+Name%2C+Official_Name__c+from+Book__c+where+Id+%3D+%27a0ZU0000008pyvQMAQ%27
  response:
    body:
      string: "{\n  \"totalSize\" : 1,\n  \"done\" : true,\n  \"records\" : [ {\n
        \   \"attributes\" : {\n      \"type\" : \"Book__c\",\n      \"url\" : \"/services/data/v57.0/sobjects/Book__c/a0ZU0000008pyvQMAQ\"\n
        \   },\n    \"Name\" : \"University Physics (Calc)\",\n    \"Official_Name__c\"
        : \"University Physics\"\n  } ]\n}"
    headers:
      Cache-Control:
      - no-cache,must-revalidate,max-age=0,no-store,private
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Tue, 27 Feb 2024 23:19:21 GMT
      Server:
      - sfdcedge
      Set-Cookie:
      - CookieConsentPolicy=0:1; path=/; expires=Wed, 26-Feb-2025 23:19:21 GMT; Max-Age=31536000;
        secure
      - LSKey-c$CookieConsentPolicy=0:1; path=/; expires=Wed, 26-Feb-2025 23:19:21
        GMT; Max-Age=31536000; secure
      Sforce-Limit-Info:
      - api-usage=63309/5000000
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains
      Transfer-Encoding:
      - chunked
      Vary:
      - Accept-Encoding
      X-Content-Type-Options:
      - nosniff
      X-Robots-Tag:
      - none
      X-SFDC-Edge-Cache:
      - MISS
      X-SFDC-Request-Id:
      - bb57bdbf4d3796310f25029ae170f943
    status:
      code: 200
      message: OK
version: 1
